# Merging DataFrames & Series

## pd.concat( ) with Series

In [1]:
import pandas as pd

In [2]:
s1 = pd.Series(['a', 'b', 'c'])
s2 = pd.Series(['d', 'e', 'f', 'z'])

In [3]:
# 'concat' method places one series on top of another 

pd.concat([s1,s2])

0    a
1    b
2    c
0    d
1    e
2    f
3    z
dtype: object

In [4]:
pd.concat([s2, s1])

0    d
1    e
2    f
3    z
0    a
1    b
2    c
dtype: object

In [5]:
# replacing order of series = replacing order of concatination

pd.concat([s2, s1], ignore_index = True)

0    d
1    e
2    f
3    z
4    a
5    b
6    c
dtype: object

In [6]:
# to put series side by side use 'axis' argument (concatenation by index)

pd.concat([s1,s2], axis = 1)

     0  1
0    a  d
1    b  e
2    c  f
3  NaN  z

In [7]:
# to name columns of the dataframe use 'keys' argument

pd.concat([s1,s2], axis = 1, keys = ['one', 'two'])

   one two
0    a   d
1    b   e
2    c   f
3  NaN   z

## pd.concat( ) with DataFrames

In [8]:
fruits = pd.Series(
    data=["apple", "banana", "cherry", "durian"], 
    index=["a", "b", "c", "d"]
)

animals = pd.Series(
    data=["badger", "cougar", "anaconda", "elk", "pika"], 
    index=["b", "c", "a", "e", "p"]
)

In [9]:
# by default 'concat' method works as outer join in SQL (see NA values below)

# note, that 'axis' argument merges series by their index

pd.concat([animals, fruits], axis = 1, keys = ['animal', 'fruit'])

     animal   fruit
b    badger  banana
c    cougar  cherry
a  anaconda   apple
e       elk     NaN
p      pika     NaN
d       NaN  durian

In [10]:
# inner join = full match

pd.concat([animals, fruits], axis = 1, join = "inner")

          0       1
b    badger  banana
c    cougar  cherry
a  anaconda   apple

## Combining DataFrames With Merge

In [11]:
teams = pd.DataFrame(
    [
        ["Suns", "Phoenix", 20, 4], 
        ["Mavericks", "Dallas", 11,12], 
        ["Rockets", "Houston", 7, 16],
        ['Nuggets', "Denver", 11, 12]
    ], 
    columns=["team", "city", "wins", "losses"]
)

In [12]:
cities = pd.DataFrame(
    [
        ["Houston", "Texas", 2310000], 
        ["Phoenix", "Arizona", 1630000], 
        ["San Diego", "California", 1410000],
        ["Dallas", "Texas", 1310000]
    ],
    columns=["city", "state", "population"]
)

In [13]:
teams

        team     city  wins  losses
0       Suns  Phoenix    20       4
1  Mavericks   Dallas    11      12
2    Rockets  Houston     7      16
3    Nuggets   Denver    11      12

In [14]:
cities

        city       state  population
0    Houston       Texas     2310000
1    Phoenix     Arizona     1630000
2  San Diego  California     1410000
3     Dallas       Texas     1310000

In [15]:
# to merge dfs on specific column use 'on' argument

teams.merge(cities, on = "city", how = "inner")

        team     city  wins  losses    state  population
0       Suns  Phoenix    20       4  Arizona     1630000
1  Mavericks   Dallas    11      12    Texas     1310000
2    Rockets  Houston     7      16    Texas     2310000

In [16]:
# teams = left side
# cities = right side

teams.merge(cities, how = "left")

        team     city  wins  losses    state  population
0       Suns  Phoenix    20       4  Arizona   1630000.0
1  Mavericks   Dallas    11      12    Texas   1310000.0
2    Rockets  Houston     7      16    Texas   2310000.0
3    Nuggets   Denver    11      12      NaN         NaN

## Using Suffixes When Merging DataFrames

In [17]:
midterms = pd.DataFrame(
    [['alex', 'padilla', 92], ['rayna', 'wilson', 83], ['juan', 'gomez', 78], ['angela', 'smith', 66],['stephen', 'yu', 98]], 
    columns=['first', 'last', 'score']
)
finals = pd.DataFrame(
    [['alex','padilla', 97, False], ['rayna', 'wilson', 88, False], ['alex', 'smith', 86, True], ['juan', 'gomez', 71, True], ['stephen', 'yu', 78, False], ['sakura', 'steel', 100, True]], 
    columns=['first', 'last','score', 'extra_credit']
)

In [18]:
midterms

     first     last  score
0     alex  padilla     92
1    rayna   wilson     83
2     juan    gomez     78
3   angela    smith     66
4  stephen       yu     98

In [19]:
finals

     first     last  score  extra_credit
0     alex  padilla     97         False
1    rayna   wilson     88         False
2     alex    smith     86          True
3     juan    gomez     71          True
4  stephen       yu     78         False
5   sakura    steel    100          True

In [20]:
# columns 'score' from both dfs renamed by adding suffixes

midterms.merge(finals, on = ["first", "last"], how = "inner", suffixes = ("_midterms", "_finals"))

     first     last  score_midterms  score_finals  extra_credit
0     alex  padilla              92            97         False
1    rayna   wilson              83            88         False
2     juan    gomez              78            71          True
3  stephen       yu              98            78         False